In [11]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

In [13]:
df = pd.read_csv("car_data.csv")
df

     User ID  Gender  Age  AnnualSalary  Purchased
0        385    Male   35         20000          0
1        681    Male   40         43500          0
2        353    Male   49         74000          0
3        895    Male   40        107500          1
4        661    Male   25         79000          0
..       ...     ...  ...           ...        ...
995      863    Male   38         59000          0
996      800  Female   47         23500          0
997      407  Female   28        138500          1
998      299  Female   48        134000          1
999      687  Female   44         73500          0

[1000 rows x 5 columns]

In [15]:
x = df[["Age","AnnualSalary"]]
y = df["Purchased"]

In [17]:
x

     Age  AnnualSalary
0     35         20000
1     40         43500
2     49         74000
3     40        107500
4     25         79000
..   ...           ...
995   38         59000
996   47         23500
997   28        138500
998   48        134000
999   44         73500

[1000 rows x 2 columns]

In [19]:
y

0      0
1      0
2      0
3      1
4      0
      ..
995    0
996    0
997    1
998    1
999    0
Name: Purchased, Length: 1000, dtype: int64

In [32]:
from sklearn.model_selection import train_test_split

In [34]:
#from sklearn.model_selection import train_test_split
x_train, x_test, y_train, y_test =train_test_split(x,y,test_size = 0.2, random_state=42)

In [36]:
x_train

     Age  AnnualSalary
29    38        147500
535   59         24500
695   35         91000
557   43         76500
836   31        118000
..   ...           ...
106   36         56500
270   42         53000
860   37         33000
435   43        112000
102   26         80000

[800 rows x 2 columns]

In [40]:
y_train

29     1
535    1
695    1
557    0
836    1
      ..
106    0
270    0
860    0
435    1
102    0
Name: Purchased, Length: 800, dtype: int64

In [44]:
!pip install scikit-learn

Requirement already satisfied: scikit-learn in c:\users\north tech\documents\python scripts\lib\site-packages (1.4.2)
Requirement already satisfied: numpy>=1.19.5 in c:\users\north tech\documents\python scripts\lib\site-packages (from scikit-learn) (1.26.4)
Requirement already satisfied: scipy>=1.6.0 in c:\users\north tech\documents\python scripts\lib\site-packages (from scikit-learn) (1.13.1)
Requirement already satisfied: joblib>=1.2.0 in c:\users\north tech\documents\python scripts\lib\site-packages (from scikit-learn) (1.4.2)
Requirement already satisfied: threadpoolctl>=2.0.0 in c:\users\north tech\documents\python scripts\lib\site-packages (from scikit-learn) (2.2.0)

In [50]:
from sklearn.linear_model  import LogisticRegression
print("import LogReg successfully")

import LogReg successfully

In [52]:

model = LogisticRegression()